golden_features = {
    "new_features": [
        {
            "feature1": "сумма согласований",
            "feature2": "diff",
            "operation": "multiply",
            "score": 0.292319822
        },
        {
            "feature1": "сумма месяцев",
            "feature2": "diff",
            "operation": "multiply",
            "score": 0.2924310908
        },
        {
            "feature1": "diff",
            "feature2": "Месяц2",
            "operation": "ratio",
            "score": 0.2925065387
        },
        {
            "feature1": "Месяц2",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2925065387
        },
        {
            "feature1": "diff",
            "feature2": "Согласование заказа 2",
            "operation": "multiply",
            "score": 0.2927059368
        },
        {
            "feature1": "сумма обработчиков",
            "feature2": "diff",
            "operation": "multiply",
            "score": 0.2928649777
        },
        {
            "feature1": "сумма месяцев",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2929452535
        },
        {
            "feature1": "diff",
            "feature2": "сумма месяцев",
            "operation": "ratio",
            "score": 0.292979994
        },
        {
            "feature1": "diff",
            "feature2": "Количество циклов согласования",
            "operation": "multiply",
            "score": 0.2930297051
        },
        {
            "feature1": "diff",
            "feature2": "сумма обработчиков",
            "operation": "ratio",
            "score": 0.2931465004
        },
        {
            "feature1": "diff",
            "feature2": "Количество обработчиков 7",
            "operation": "multiply",
            "score": 0.2931511865
        },
        {
            "feature1": "diff",
            "feature2": "Количество позиций",
            "operation": "ratio",
            "score": 0.2931816006
        },
        {
            "feature1": "Количество позиций",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2931816006
        },
        {
            "feature1": "Длительность",
            "feature2": "До поставки",
            "operation": "diff",
            "score": 0.2931998375
        },
        {
            "feature1": "сумма обработчиков",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2932082306
        },
        {
            "feature1": "diff",
            "feature2": "Количество",
            "operation": "multiply",
            "score": 0.293249649
        },
        {
            "feature1": "diff",
            "feature2": "Количество обработчиков 30",
            "operation": "ratio",
            "score": 0.2932739145
        },
        {
            "feature1": "Количество обработчиков 30",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.29333564
        },
        {
            "feature1": "diff_divide",
            "feature2": "Дней между 6_7",
            "operation": "sum",
            "score": 0.2933559511
        },
        {
            "feature1": "diff",
            "feature2": "Количество обработчиков 7",
            "operation": "ratio",
            "score": 0.2934892937
        },
        {
            "feature1": "Месяц1",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2935509211
        },
        {
            "feature1": "Количество обработчиков 7",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2935510387
        },
        {
            "feature1": "diff",
            "feature2": "Длительность",
            "operation": "ratio",
            "score": 0.2937447919
        },
        {
            "feature1": "Длительность",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2937447919
        },
        {
            "feature1": "diff",
            "feature2": "Количество",
            "operation": "ratio",
            "score": 0.2938757412
        },
        {
            "feature1": "Количество",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2938757412
        },
        {
            "feature1": "diff",
            "feature2": "Длительность",
            "operation": "multiply",
            "score": 0.2938960811
        },
        {
            "feature1": "diff",
            "feature2": "Количество обработчиков 15",
            "operation": "ratio",
            "score": 0.2939199919
        },
        {
            "feature1": "Количество обработчиков 15",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2939817256
        },
        {
            "feature1": "Дней между 5_6",
            "feature2": "diff",
            "operation": "diff",
            "score": 0.2964158526
        },
        {
            "feature1": "diff_divide",
            "feature2": "Дней между 5_6",
            "operation": "sum",
            "score": 0.2970664614
        },
        {
            "feature1": "diff_divide",
            "feature2": "Дней между 6_7",
            "operation": "multiply",
            "score": 0.2971788695
        },
        {
            "feature1": "Дней между 6_7",
            "feature2": "diff_divide",
            "operation": "diff",
            "score": 0.2973652349
        },
        {
            "feature1": "diff",
            "feature2": "Количество обработчиков 15",
            "operation": "multiply",
            "score": 0.2974696614
        },
        {
            "feature1": "diff",
            "feature2": "Количество обработчиков 30",
            "operation": "multiply",
            "score": 0.2975674941
        },
        {
            "feature1": "diff_divide",
            "feature2": "Дней между 6_7",
            "operation": "ratio",
            "score": 0.2976554936
        },
        {
            "feature1": "diff",
            "feature2": "Дней между 6_7",
            "operation": "sum",
            "score": 0.2983018728
        },
        {
            "feature1": "diff",
            "feature2": "6_7_norm",
            "operation": "diff",
            "score": 0.2985236411
        },
        {
            "feature1": "Количество циклов согласования",
            "feature2": "diff",
            "operation": "ratio",
            "score": 0.2985564216
        },
        {
            "feature1": "diff",
            "feature2": "Количество циклов согласования",
            "operation": "ratio",
            "score": 0.2985575504
        }
    ],
    "new_columns": [
        "сумма согласований_multiply_diff",
        "сумма месяцев_multiply_diff",
        "diff_ratio_Месяц2",
        "Месяц2_ratio_diff",
        "diff_multiply_Согласование заказа 2",
        "сумма обработчиков_multiply_diff",
        "сумма месяцев_ratio_diff",
        "diff_ratio_сумма месяцев",
        "diff_multiply_Количество циклов согласования",
        "diff_ratio_сумма обработчиков",
        "diff_multiply_Количество обработчиков 7",
        "diff_ratio_Количество позиций",
        "Количество позиций_ratio_diff",
        "Длительность_diff_До поставки",
        "сумма обработчиков_ratio_diff",
        "diff_multiply_Количество",
        "diff_ratio_Количество обработчиков 30",
        "Количество обработчиков 30_ratio_diff",
        "diff_divide_sum_Дней между 6_7",
        "diff_ratio_Количество обработчиков 7",
        "Месяц1_ratio_diff",
        "Количество обработчиков 7_ratio_diff",
        "diff_ratio_Длительность",
        "Длительность_ratio_diff",
        "diff_ratio_Количество",
        "Количество_ratio_diff",
        "diff_multiply_Длительность",
        "diff_ratio_Количество обработчиков 15",
        "Количество обработчиков 15_ratio_diff",
        "Дней между 5_6_diff_diff",
        "diff_divide_sum_Дней между 5_6",
        "diff_divide_multiply_Дней между 6_7",
        "Дней между 6_7_diff_diff_divide",
        "diff_multiply_Количество обработчиков 15",
        "diff_multiply_Количество обработчиков 30",
        "diff_divide_ratio_Дней между 6_7",
        "diff_sum_Дней между 6_7",
        "diff_diff_6_7_norm",
        "Количество циклов согласования_ratio_diff",
        "diff_ratio_Количество циклов согласования"
    ],
    "ml_task": "binary_classification"
}


# числовые признаки, которые дальше будем использовать при агрегации
whynotcols = ['Количество обработчиков 7', 'Количество обработчиков 15',
       'Количество обработчиков 30', 'Согласование заказа 1',
       'Согласование заказа 2', 'Согласование заказа 3',
       'Изменение даты поставки 7', 'Изменение даты поставки 15',
       'Изменение даты поставки 30',
       'Отмена полного деблокирования заказа на закупку',
       'Изменение позиции заказа на закупку: изменение даты поставки на бумаге',
       'Изменение позиции заказа на закупку: дата поставки',
       'Количество циклов согласования',
       'Количество изменений после согласований', 'Дней между 0_1',
       'Дней между 1_2', 'Дней между 2_3', 'Дней между 3_4', 'Дней между 4_5',
       'Дней между 5_6', 'Дней между 6_7', 'Дней между 7_8', 'diff', 'diff_divide',
       'сумма обработчиков', 'сумма месяцев', 'сумма согласований',
       'сумма изменений даты поставки', '0_9_norm']
whynotstats = ['median', 'std', 'min', 'max', 'mean']


cols_le = {
    'Поставщик': 'Поставщик', 
    'Материал': 'Материал', 
    'Категорийный менеджер': 'Категор. менеджер',
    'Операционный менеджер': 'Операц. менеджер', 
    'Завод': 'Завод', 
    'Закупочная организация': 'Закуп. организация',
    'Группа закупок': 'Группа закупок', 
    'Балансовая единица': 'Балансовая единица', 
    'ЕИ': 'Единица измерения', 
    'Группа материалов': 'Группа материалов',
    'Вариант поставки': 'Вариант поставки', 
    'НРП': 'НРП', 
    'Длительность': 'Длительность поставки', 
    'До поставки': 'Дней до плановой поставки', 
    'Месяц1': 'Месяц создания заказа',
    'Месяц2': 'Месяц старта поставок', 
    'Месяц3': 'Текущий месяц', 
    'День недели 2': "День недели старта", 
    'Сумма': 'Сумма', 
    'Количество позиций': 'Кол-во позиций',
    'Количество': 'Кол-во поставок', 
    'Количество обработчиков 7': 'Кол-во обработчиков 7 дней', 
    'Количество обработчиков 15': 'Кол-во обработчиков 15 дней',
    'Количество обработчиков 30': 'Кол-во обработчиков 30 дней', 
    'Согласование заказа 1': 'Согласование заказа 1 этап',
    'Согласование заказа 2': 'Согласование заказа 2 этап', 
    'Согласование заказа 3': 'Согласование заказа 3 этап',
    'Изменение даты поставки 7': 'Изм. даты поставки 7 дней', 
    'Изменение даты поставки 15': 'Изм. даты поставки 15 дней',
    'Изменение даты поставки 30': 'Изм. даты поставки 30 дней',
    'Отмена полного деблокирования заказа на закупку': 'Отмена деблокирования',
    'Изменение позиции заказа на закупку: изменение даты поставки на бумаге': 'Изм. поставки на бумаге',
    'Изменение позиции заказа на закупку: дата поставки': 'Изм. даты поставки',
    'Количество циклов согласования': 'Кол-во циклов согл-ния',
    'Количество изменений после согласований': 'Кол-во изменений после согл-ния', 
    'Дней между 0_1': 'Дней между 0_1 этапами',
    'Дней между 1_2': 'Дней между 1_2 этапами', 
    'Дней между 2_3': 'Дней между 2_3 этапами', 
    'Дней между 3_4': 'Дней между 3_4 этапами', 
    'Дней между 4_5': 'Дней между 4_5 этапами',
    'Дней между 5_6': 'Дней между 5_6 этапами', 
    'Дней между 6_7': 'Дней между 6_7 этапами', 
    'Дней между 7_8': 'Дней между 7_8 этапами', 
    'diff': 'Разница продолж-сти поставки и плановой даты доставки',
    'y': 'Целевая переменная'
}